{
  "id": "ajab-andaz",
  "title": {
    "original": "Ajab Andaz",
    "english": "Such strange wiles!"
  },
  "link": "https://www.youtube.com/watch?v=eXB7cYJtgOs",
  "language": "Urdu",
  "singer": "Maulvi Haider Hassan (Vehranwale)",
  "lyricist": "Syed Baqar Hussain Shah (Shahjahanpur)",
  "translation": "Musab Bin Noor (transliteration: Harman)",
  "commentary": [
    "Beautiful, soulful, Qawwali by Maulvi Haider Hassan Vehranwale and group.",
    "In this Qawwali, we see how the Sufi's devotion and single minded focus on Khuda transcends religious labels, tribalism, and attachment.",
    "Equating such a devotee to a drunkard, and the devotee's teacher as the tavern keeper; the state of fana (or egolessness) is thus described as an ecstasy obtained by a rare few - and often misunderstood by society."
  ],
  "footnotes": [
    "[1] Reference to Punjabi folk love story Sassi-Punhun."
  ],
  "lyrics": [
    [
      "madhosh bayak sagar aye peer-e-mughan kardi",
      "The tavern-keeper has intoxicated me with a single cup of wine."
    ],
    [
      "dil burdi aur jaan burdi baytaabo tabaah kardi",
      "He has snatched my body and soul, leaving me utterly defenseless."
    ],
    [
      "niqab oske ult kar yeh haqiqat mujhbe uln ki",
      "By the lifting of the Veil, this secret was revealed to me."
    ],
    [
      "yaha par khatam ho jati hai behas kufar iman ki",
      "That beyond this point, the boundaries of faith and disbelief are meaningless."
    ],
    [
      "ajab andaz tujh ko nargis e mastana ata hai",
      "O sly narcissus, what strange wiles you possess!"
    ],
    [
      "ke har hoshiar ban ne ko yaha deewana ata hai",
      "That wise men come to you, seeking the gift of madness!"
    ],
    [
      "koi zahid ho wahid ho betabanah ata hai",
      "The pious and the preachers, all rush impatiently towards you."
    ],
    [
      "samaj me jiski raade baad o pemana ata hai",
      "Whoever deciphers the mysteries of the wine and the cup:"
    ],
    [
      "vo hi masjid se uth kar jaani be mekhana ata hai",
      "Sneaks away from the mosque and heads to the tavern!"
    ],
    [
      "haqiqat mai nigahe dekh lai ti hai haqiqat ko",
      "In truth, the seeing eye can visualize the eternal Truth."
    ],
    [
      "chupa sak te nahi kasrat ke pardeh rang-e-wahdat ko",
      "The abundance of creation cannot hide the unity of the Creator!"
    ],
    [
      "zamana kya samaj sakta hai oske kuffar ulfat ko",
      "The world can scarce comprehend the blasphemies of Love."
    ],
    [
      "nazar buth me bhi jisko jalwa-e-janana aata hai",
      "The Love that makes the Beloved manifest in the face of every idol!"
    ],
    [
      "kari hai daer mai wo sajda rezi aine masti mai",
      "In my intoxication, I have made so many prostrations in the temple of the idols."
    ],
    [
      "mujhe kafar lage kehne musalmana ki basti mein",
      "That in the community of Muslims, I am known as the Infidel."
    ],
    [
      "nazar ati nahi kuch apni hasti apni hasti mein",
      "I see nothing of my Self, when I peer inside myself."
    ],
    [
      "kuch aisa kho gaya hu dil-k-hatho buth parasti me",
      "My heart has ensnared me so deeply in the ways of idolatry."
    ],
    [
      "jidar jatha ho mere samne buth-khana ata hai",
      "That I see the Idol's temple, whichever way I turn!"
    ],
    [
      "jehre pase sasri pair tare us pase khan punar",
      "Whichever way poor Sassi turns, she sees Punnu Khan before her. [1]"
    ],
    [
      "har ik ghafaz ko baqir dur-e-irfan nahi milta",
      "Baqir, not every diver can emerge from the sea with the pearl of knowledge."
    ],
    [
      "nahi is raha mein maqsood-e-dil asaan nahi milta",
      "In this path, it is well-nigh impossible to achieve the heart's desires."
    ],
    [
      "kabi gulshan mein me kanda be gule kanda nahi milta",
      "Flowers are always accompanied by thorns in this garden."
    ],
    [
      "na guzrein kuffar se jab tak kabhi iman nahi milta",
      "One cannot aspire to faith without navigating the labyrinth of doubt."
    ],
    [
      "pehle to haram ki raha mein buth-khana ata hai",
      "For on the way to the mosque, one must first pass through the temple."
    ],
    [
      "na hasil hai sakoon sehra me aur na dil ko pasti mein",
      "Be it the wilderness or civilization, my heart cannot find peace."
    ],
    [
      "bulandi par guzar hota na mera hota pasti mein",
      "I can dwell neither on lofty height, nor in sunken depths."
    ],
    [
      "kabar takbeer nahi toh meher-o-ulfat parasti mein.",
      "In my worship of Love, I have lost all sense of space and time."
    ],
    [
      "hijab-e-gaib ke pardeh uthe kuch kaif masti mein",
      "When the veils of my sweet intoxication lift for a brief moment:"
    ],
    [
      "na jane kiski hasti dekhta hu apni hasti mein",
      "I do not recognize the person masquerading as me!"
    ],
    [
      "mein ho vo rind meri zindgi mekhane mein guzri",
      "I am the drunkard whose entire life was spent in the tavern."
    ],
    [
      "meri izat kiya karte the sufi zahid aur mukti",
      "I was highly respected amongst the mystics, preachers, and the jurists."
    ],
    [
      "meri kurbat pe ake khud yeh saki ne dua mangi",
      "By my graveside, even the tavern-keeper uttered a prayer:"
    ],
    [
      "khuda bakshe bahut achi guzari mein parasti me",
      "May the Lord bless him, for he lived a life of intoxication, and lived it well!"
    ],
    [
      "ke pinha atish-e-furqat ke sine me bahut sholay",
      "In my heart burned the hidden flames of separation."
    ],
    [
      "nazar si char rooh meri faristhe leke jab paunche",
      "I was aware of the moment the angels came to collect my soul."
    ],
    [
      "tarashe-e-buth buthi ko dekh kar jannat mein yu bhole",
      "Upon seeing me in Paradise, its beauteous inhabitants exclaimed in surprise:"
    ],
    [
      "ye kafir kyon chala aya musalmano ki basti mein",
      "'Who let this infidel inside the dwelling-place of Muslims?'"
    ]

  ]
}
