{
  "title": {
    "0": "Ja Mur Ja Aje Vi Ghar Mur Ja",
    "1": "Turn away! Still you can turn away to your home!"
  },
  "link": "https://www.youtube.com/watch?v=nryoXYUUHgM",
  "language": "Punjabi",
  "singer": "Nusrat Fateh Ali Khan",
  "lyricist": "Bari",
  "translation": "Harman",
  "commentary": [
    "A warning to the wayfarer: Stay away from love!"
  ],
  "footnotes": [
    "[1] Heer is the female protagonist from Punjabi folk love story Heer-Ranjha.",
    "[2] Ali is one of the central figures of Shia Islam.",
    "[3] Muhammad is the prophet of Islam.",
    "[4] Fatima is one of Muhammad's daughters.",
    "[5] Reference to Punjabi folk love story Sohni-Mahiwal.",
    "[6] Sohni is the female protagonist from Punjabi folk love story Sohni-Mahiwal.",
    "[7] Reference to Punjabi folk love story Sassi-Punhun.",
    "[8] In the story Sohni-Mahiwal, Sohni drowns in the river Chenab trying to reach Mahiwal.",
    "[9] In the story Sassi-Punhun, Sassi dies of heat exhaustion in the desert trying to reach Punhun."
  ],
  "lyrics": [
    {
      "0": "ishq de mehkame gaya main ik din",
      "1": "One day, I went to the house of love."
    },
    {
      "0": "aggo ishq ne meri badeyayi thag layi",
      "1": "But instead, love stole my good virtue!"
    },
    {
      "0": "main te gaya saan ishq ton daad lehne",
      "1": "I had gone there simply to appreciate what love was."
    },
    {
      "0": "aggon ishq ne meri dunayi thag layi",
      "1": "But instead, love robbed me of my holiness!"
    },
    {
      "0": "es ishq ne bade bade thag laye karu baadshah di baadshsahi thag layi",
      "1": "This love has stolen from wise people of the past - love even stole the kingship from King Karu!"
    },
    {
      "0": "tain ki thageya ashq daara es ishq ne khuda di khudayi thag kayi",
      "1": "What love has stolen from me is nothing in comparison - love stole Godliness from God!"
    },
    {
      "0": "yaari ishq de naal na laa baithin eh yaar bana ke lut lainda",
      "1": "Don't befriend love, it seems friendly at first, but then it steals from you!"
    },
    {
      "0": "eh ishq awalra daku eh bas nain mila ke lut lainda",
      "1": "This love is a unique robber, with just its eyes it can steal from you!"
    },
    {
      "0": "eh ishq vi awala ehde kam vi awale",
      "1": "This love is unique, it's workings and ways are unique also."
    },
    {
      "0": "jihde pesh pe janda khak chadtha nahi pale",
      "1": "Whomever it goes after, it leaves nothing in that poor person's possession."
    },
    {
      "0": "ja mur ja aje vi ghar mur ja ni ishq ch ki rakheya",
      "1": "Turn away! Still you can turn away to your home! What do you expect to find in love?"
    },
    {
      "0": "ishq diyan ne hazoor badiyan manzilan ne door",
      "1": "Listen respected person, the destination of love is still far away."
    },
    {
      "0": "ehne dube lakhan poor eh nahi vekhda kasoor",
      "1": "It has sunk many innocent people, it doesn't consider your guilt or innocence."
    },
    {
      "0": "phad ke khal khich lehnda eh khayaal rakh layin",
      "1": "It will grab you and skin you alive - keep that in your mind!"
    },
    {
      "0": "eh joban nahi labhna lakhi vela gaya na aaunda hathi",
      "1": "Your youth will never come back; and the present is slipping from your hands!"
    },
    {
      "0": "ishq tatteh nu door hi rakhi rul na jaawin kidre kakhi",
      "1": "Keep this heat of love far from you, don't become destitute and pitiful!"
    },
    {
      "0": "pal vich neetiyan jawan akhi heer de waangar zehar na vakhi",
      "1": "In moments, your eyes will be stolen! Like Heer[1] don't drink this poison!"
    },
    {
      "0": "ja mur ja aje vi ghar mur ja ni ishq ch ki rakheya",
      "1": "Turn away! Still you can turn away to your home! What do you expect to find in love?"
    },
    {
      "0": "ishq di reet hai sare jag tu jud na eh rah dekhda na khura dhekhda",
      "1": "The way of love is different from the rest of the world - it doesn't look for well trodden paths."
    },
    {
      "0": "ishq layi da halde khuli ek sar ha na eh shah dekhda na ghada dehkda",
      "1": "For love, the mansion and hut are the same - it doesn't differentiate between king and beggar."
    },
    {
      "0": "ghar ali da hove ja mohammad da ghar fatima da hove chahe lakh de jigar",
      "1": "Whether it be Ali's[2] house, or Muhammad's[3] house, whether Fatima's[4] or a beloved friend's."
    },
    {
      "0": "jithe ji chave chakaunda ashq da sar khana kaaba te na karbala dhekha",
      "1": "Wherever love wishes, there it bows the head of the lover - it doesn't distinguish between the house and the holy place."
    },
    {
      "0": "maut ishq nu kithe eh maut nu vi far maut di neend suna chadtha",
      "1": "What is death to love? It can grab death, and make death itself sleep the sleep of death!"
    },
    {
      "0": "cherhi tasdi di vich ja varda othe a ishq ujjare pa chadtha",
      "1": "That body which love enters - it leaves it ruined!"
    },
    {
      "0": "ja mur ja aje vi ghar mur ja ni ishq ch ki rakheya",
      "1": "Turn away! Still you can turn away to your home! What do you expect to find in love?"
    },
    {
      "0": "pair aggan wal dharna payega kache ghare te tarna payega",
      "1": "You will have to step forward - you will have to float with just an unfinished pot[5]!"
    },
    {
      "0": "dard vi mitha zarna payega apne aap toh darna payega",
      "1": "Even sweet pain you will have to endure - you will have to become afraid of yourself!"
    },
    {
      "0": "baazi jit ke harna payega sohni waanga marna payega",
      "1": "After winning the gamble, you will have to lose anyway! You will have to die like Sohni[6]!"
    },
    {
      "0": "ja mur ja aje vi ghar mur ja ni ishq ch ki rakheya",
      "1": "Turn away! Still you can turn away to your home! What do you expect to find in love?"
    },
    {
      "0": "sassi wangar tapdi rahengi punhun punhun japdi rahengi",
      "1": "Like Sassi you will burn up! You will keep chanting 'Punhun', 'Punhun'[7]!"
    },
    {
      "0": "agg ishq di nappdi rahengi maru thal vich thapdi rahengi",
      "1": "You will keep trying to contain the heat of love - in the desert you will keep burning!"
    },
    {
      "0": "tor je turdi sapp di rahengi vich kitaaban chapdi rahengi",
      "1": "You will keep crawling like a snake - for all time, you will keep getting published in love stories!"
    },
    {
      "0": "ja mur ja aje vi ghar mur ja ni ishq ch ki rakheya",
      "1": "Turn away! Still you can turn away to your home! What do you expect to find in love?"
    },
    {
      "0": "pehle soch lai eh ishq lakoya vi nahi jaana",
      "1": "First contemplate this - you will not even be able to hide love."
    },
    {
      "0": "pher bhajna te ki e khaloya vi nahi jaana",
      "1": "Then, forget about running, you won't even be able to stand still!"
    },
    {
      "0": "ja mur ja aje vi ghar mur ja ni ishq ch ki rakheya",
      "1": "Turn away! Still you can turn away to your home! What do you expect to find in love?"
    },
    {
      "0": "je tain ishq gal pauna saah sukh da nahi auna",
      "1": "If you embrace love - you will never breathe easily again!"
    },
    {
      "0": "paina kandeya te sauna rona umaran nu rona",
      "1": "You will have to sleep on thorns! You will cry for many lifetimes, in just one lifetime!"
    },
    {
      "0": "ehthe sir dena painda eh khayaal rakh layi",
      "1": "When in love, you must cut off your own head - keep that in mind."
    },
    {
      "0": "ja mur ja aje vi ghar mur ja ni ishq ch ki rakheya",
      "1": "Turn away! Still you can turn away to your home! What do you expect to find in love?"
    },
    {
      "0": "ishq de naal naal na aada laawin",
      "1": "Don't take refuge in love!"
    },
    {
      "0": "dil athre nu bai samjhaawin",
      "1": "Sit down and explain this to your rebellious heart!"
    },
    {
      "0": "'bari' de waangar na pachchtaawin",
      "1": "Like the poet 'Bari', don't make a decision that you will regret!"
    },
    {
      "0": "beleyan de vich pair na paawin",
      "1": "Don't set foot into the congregation of lovers!"
    },
    {
      "0": "vich chenab na gote khaawin",
      "1": "Don't drown in the Chenab[8] river!"
    },
    {
      "0": "maru thal vich sarh na jaawin",
      "1": "Don't burn to death in the desert[9]!"
    },
    {
      "0": "ja mur ja aje vi ghar mur ja ni ishq ch ki rakheya",
      "1": "Turn away! Still you can turn away to your home! What do you expect to find in love?"
    }
  ]
}
