{
  "id": "punjab-di-malika",
  "title": {
    "original": "Kamli",
    "english": "Insane"
  },
  "link": "https://www.youtube.com/watch?v=TEndDGGmXzU",
  "language": "Punjabi",
  "singer": "Hadiqa Kiani",
  "lyricist": "Baba Bulleh Shah",
  "translation": "Harman",
  "commentary": [
    "A journey into the thinking of the Sufis, such as the great Bulleh Shah.",
    "This may be interpreted in at least two different ways:",
    "1. The ravings of a supposed 'madman' to a spiritual aspirant; revealed to be fundamental truth.",
    "2. An inner dialogue between the ego [the spiritual aspirant] and the higher Self [the 'madman']."
  ],
  "footnotes": [],
  "lyrics": [
    [
      "ve bole bheti da tainu khabar naiyo sajna",
      "You speak much, but you have no knowledge of one thing, my friend:"
    ],
    [
      "jehda nit tere vich bolda eh",
      "The one who speaks through you everyday."
    ],
    [
      "dhoonde bahar ja ke labbe ghar akay",
      "You look for it outside, but it sits within your home."
    ],
    [
      "wang murli kooda hai pharolda",
      "Like a scavenger, you sift through garbage!"
    ],
    [
      "o bulleh shah jo tere ton vakh na hovay",
      "O Bulleh Shah: That one who cannot be separated from you."
    ],
    [
      "apay vaaj maaray apay bolda eh",
      "When you call for it, it responds by itself."
    ],
    [
      "haaji lok makkeh nu janday",
      "The pilgrims go to Mecca:"
    ],
    [
      "mera ranjha mahi paka ni mein kamli aan",
      "But my Beloved is unyielding! Oh, I am insane!"
    ],
    [
      "ni main kamli aan ni main kamli aan",
      "Oh, I am insane! Oh, I am insane!"
    ],
    [
      "karleh dil di safayi je deedar chahida",
      "Clean your inner self, if you wish to catch a glimpse of the Beloved!"
    ],
    [
      "tu jahan ton ki laina tainu yaar chahida",
      "What do you need of the world? You need only the Beloved!"
    ],
    [
      "chaar chaphere kahnu takkaran maarda eh",
      "Why do you make futile attempts in every direction?"
    ],
    [
      "jittiyan hoyan baaziyan kanu haarda eh",
      "Why do you try to lose gambles that you have already won?"
    ],
    [
      "vekh le sohna har har de vich vasda",
      "Look carefully: The Beautiful One permeates each and everything!"
    ],
    [
      "teriyan oh kartootan dekh ke hasda",
      "Seeing your strange habits, it laughs!"
    ],
    [
      "ghare gawachi cheez tandoda shehar vich",
      "You have lost this thing in your home, yet you go to search in the city."
    ],
    [
      "fark nahi disda tenu apne ger vich",
      "Do you not see the difference between one's own and the other?"
    ],
    [
      "kehn siyane dil hai khaana rab da",
      "The wise ones say: The inner self is the hiding place of God."
    ],
    [
      "je labay ta yaar khazana lab da",
      "If it is found, then my friend, a treasure is found!"
    ],
    [
      "gaur te karke vekh akal dey aneya",
      "Reflect upon this, oh you of insufficient intellect:"
    ],
    [
      "kudrat vehki fer vi rab na maneya",
      "You have seen nature, yet you have not recognized God?"
    ],
    [
      "je rab milta nateya dhoteya",
      "If God is to be found by bathing and cleaning:"
    ],
    [
      "tan milda dadoan machhiyan",
      "Then God is found by frogs and fish!"
    ],
    [
      "je rab milda jungle vele",
      "If God is to be found by defecating:"
    ],
    [
      "tan milda gaooa majjiyan",
      "Then God is found by cows and buffalos!"
    ],
    [
      "je rab mil da vich masiti",
      "If God is found within the Mosque:"
    ],
    [
      "tan milda chamcharikiya",
      "Then he is found by bats!"
    ],
    [
      "bulleya rab ohna nu milda",
      "Bulleh Shah says: God is found by those:"
    ],
    [
      "bhai neeta jinha diyan sachian",
      "Who have true intentions!"
    ],
    [
      "ni main kamli aan ni main kamli aan",
      "Oh, I am insane! Oh, I am insane!"
    ],
    [
      "ohde hath vich koi talwar vi nahi",
      "It carries no sword in it's hand:"
    ],
    [
      "ohda khaali janda vaar vi nahi",
      "Yet, none of it's strikes miss!"
    ],
    [
      "padh-padh ilm hazar kitaban",
      "Reading and reading, thousands of prayers and books:"
    ],
    [
      "kadi apne aap nu padeya nahi",
      "Yet, you have not read yourself!"
    ],
    [
      "ja ja vad-de mandir masiti",
      "Going and going, to the Mandir and the Mosque:"
    ],
    [
      "kade mann apne vich vadeya nahi",
      "Yet, you have not gone inside your mind!"
    ],
    [
      "awin lad-da e shaitan de naal bandeya",
      "Oh Man! Futily you fight against Satan:"
    ],
    [
      "kade nafs apne naal ladeya nahi",
      "Yet, you have not fought with your own ego!"
    ],
    [
      "akhe peer bulleh shah",
      "Says Bulleh Shah, the Sufi elder:"
    ],
    [
      "asmani udh deya fad da eh",
      "You attempt to capture that which flies in the sky."
    ],
    [
      "jeda mann vich vasda ohnu phadeya nahi",
      "Yet, you have not even caught the one who lives in your own mind!"
    ],
    [
      "ni main kamli aan ni main kamli aan",
      "Oh, I am insane! Oh, I am insane!"
    ],
    [
      "sach akheyan bhambad machda eh",
      "Speaking the truth causes turmoil to erupt!"
    ],
    [
      "jooth bholeya kuch na bachda eh",
      "Yet, speaking lies leaves nothing of value left."
    ],
    [
      "ni main kamli aan ni main kamli aan",
      "Oh, I am insane! Oh, I am insane!"
    ],
    [
      "ho main tan mandiran chad-di hoyi aan",
      "Oh, I have left the temples:"
    ],
    [
      "mera babul kalla ae kalla [?]",
      "My Father is One and only."
    ],
    [
      "maadi matli teri pasand meinu",
      "This sickness of Yours! Is enjoyable to me!"
    ],
    [
      "ni main kamli aan ni main kamli aan",
      "Oh, I am insane! Oh, I am insane!"
    ]
  ]
}