{
  "id": "punjab-di-malika",
  "title": {
    "original": "Ni, Marhiya Sher Punjab Diya",
    "english": "Oh, 'Grave of the Lion of Punjab'"
  },
  "link": "https://www.youtube.com/watch?v=lGo0pPCHdoM",
  "language": "Punjabi",
  "singer": "Dhadi Jatha Gurbaksh Singh Albela",
  "lyricist": "Gurbaksh Singh Albela",
  "translation": "Harman",
  "commentary": [
    "A wayfarer laments at the grave of the Lion of Punjab (Maharaja Ranjit Singh)."
  ],
  "footnotes": [
    "[1] 'Rangila' could be translated here as 'colorful', 'vibrant', or 'diverse'."
  ],
  "lyrics": [
    [
      "ni marhiya sher punjab diya, ek vaar jugade sher nu",
      "Oh, 'Grave of the Lion of Punjab', wake the Lion just once!"
    ],
    [
      "malik panj dariyava da, teri godh ch pul ke saugeya",
      "The master of the five rivers, has forgetfully fallen asleep in your lap."
    ],
    [
      "sutheya nu chir hogeya, aj hor zamana bau geya",
      "That sleep has been lengthy, today a new world has manifested."
    ],
    [
      "ek duna maar jugade ta, tu jodhe babbar lehr nu",
      "Give a sound to awaken him - the warrior lion!"
    ],
    [
      "ni marhiya sher punjab diya, ek vaar jugade sher nu",
      "Oh, 'Grave of the Lion of Punjab', wake the Lion just once!"
    ],
    [
      "ankhi jodhe di hik utte, aj gehra de chande chul gaye",
      "Upon the chest of that honorable warrior, the flags of foreigners fly."
    ],
    [
      "sutta kup nehra vich, aj deevey sabh ghul gaye",
      "He is sleeping in darkness, even the lamps have gone out."
    ],
    [
      "jay aj na suraj chamkeya, ta chamku kehri vehr nu",
      "If today the sun doesn't shine, then when shall it shine?"
    ],
    [
      "ni marhiya sher punjab diya, ek vaar jugade sher nu",
      "Oh, 'Grave of the Lion of Punjab', wake the Lion just once!"
    ],
    [
      "loto kabul kandahar te, teri aj vi shaani par rahe",
      "Kabul and Kandahar have been cut off, yet your sign remains. "
    ],
    [
      "mara babbar teriya, aj giddhar kalola kar rahe",
      "Your conquests, oh Lion, today the jackals have carved them up!"
    ],
    [
      "deh jalwa ek talwar da, aj chukna gadhar haner nu",
      "Display your sword once, today let this darkness be dispelled."
    ],
    [
      "ni marhiya sher punjab diya, ek vaar jugade sher nu",
      "Oh, 'Grave of the Lion of Punjab', wake the Lion just once!"
    ],
    [
      "tak le tere punjab nu, kive lahu de hanju roh reha",
      "Look upon your Punjab - how it cries tears of blood!"
    ],
    [
      "panth rangila soneya, kive kehru kehru ho reha",
      "The vibrant [1] tradition, beloved - how it has become fragments."
    ],
    [
      "akh pat le pati punjab deya, hon la na ehni dehr nu",
      "Spare a glance - beloved of Punjab - do not delay now!"
    ],
    [
      "ni marhiya sher punjab diya, ek vaar jugade sher nu",
      "Oh, 'Grave of the Lion of Punjab', wake the Lion just once!"
    ]
  ]
}