{
  "id": "sar-jhukaya-ton",
  "title": {
    "original": "Sar Jhukaya Ton",
    "english": "As I bowed my head."
  },
  "link": "https://www.youtube.com/watch?v=faCEcfqHgnY",
  "language": "Urdu",
  "singer": "Nusrat Fateh Ali Khan",
  "lyricist": "Mohammad Iqbal Qasoori",
  "translation": "Harman",
  "commentary": [
    "A unique interlacing between contradictory concepts: Devotional idol worship and the all-pervading.",
    "In this qawwali, the spiritual aspirant is analogized with the lover - the Beloved manifesting as the idol.",
    "The non-responsive idol is analogized as the spurner - driving the desirer mad.",
    "Ultimately, through this madness and devotion, the idol manifests as the Truth."
  ],
  "footnotes": [
    "[1] This line is a word for word translation, but has at least a few different valid interpretations.",
    "[2] Perhaps a reference to 'loss of ego'.",
    "[3] The curer meaning a reference perhaps to the Divine."
  ],
  "lyrics": [
    [
      "lekar tumhara naam jaha sar jhuka diya",
      "Taking your name, that place where I bowed my head:"
    ],
    [
      "maine ussi dayaar ko kaaba bana diya",
      "I made that land the Holy Kaaba itself!"
    ],
    [
      "sar jhukaya toh patthar sanam bann gaye",
      "As I bowed my head, my Beloved turned to stone:"
    ],
    [
      "ishq bhatka toh haq aashna ho gaya",
      "Love became errant, and so my Beloved became the Truth [1]."
    ],
    [
      "rashq karta hai kaaba mere kufar par",
      "Even the Kaaba is envious of my idolatry:"
    ],
    [
      "maine jis buth ko pooja khuda ho gaya",
      "The idol I worshipped, became God itself!"
    ],
    [
      "gum rehi hai ke miraj hai ishq ki",
      "As it remained lost, so love ascended."
    ],
    [
      "aye junoon bol manzil hai yeh kaun si",
      "This madness: Tell me, what sort of destination is this?"
    ],
    [
      "uske ghar ka pata poochte poochte",
      "As I asked and asked, for its [love's] home."
    ],
    [
      "poochne wala khud laapta ho gaya",
      "The one who asked, himself, became lost! [2]"
    ],
    [
      "main mohabbat se muh mod leta agar",
      "If I were to turn my head away from love:"
    ],
    [
      "toot padhti yeh bijli kisi aur par",
      "Then this lightning strikes down upon someone else!"
    ],
    [
      "mere dil ki tabahi se yeh toh hua",
      "At least this happened, from the destruction of my heart:"
    ],
    [
      "kam se kam dusron ka bhala ho gaya",
      "At the very least, others attained prosperity."
    ],
    [
      "waqt-e-ahbab parchai sooraj kiran",
      "Dear friends only for a time: Shadows, the Sun, the Sun's rays,"
    ],
    [
      "log duniya khushi chaandni zindagi",
      "...people, the world, happiness, the moonlight, and life itself! "
    ],
    [
      "mere mehboob ik tere gham ke siwa",
      "My Beloved, except only for your sorrow:"
    ],
    [
      "jo mila raaste mein juda ho gaya",
      "All else encountered on this path, has drifted away."
    ],
    [
      "karobaar-e-tamana mein yeh to hua",
      "At least this happened, from the trading of wishes:"
    ],
    [
      "unke kadmon pe marne ka mauka mila",
      "I was given a chance - to die in their footsteps!"
    ],
    [
      "zindagi bhar toh ghata uthaate rahe",
      "Throughout life, I've encountered only diminishments:"
    ],
    [
      "aaj pehli dafa faayda ho gaya",
      "Today, for the first time, something has been gained."
    ],
    [
      "aisa bhatka ke lauta nahi aaj tak",
      "I became so errant, that I have not returned - to this day!"
    ],
    [
      "aisa bichchda ke aaya nahi aaj tak",
      "I became so separated, that I never went back - to this day!"
    ],
    [
      "dil bi kambakht iska darman walla",
      "My heart has good fortune, alas its curer..."
    ],
    [
      "aapke ghar gaya aapka ho gaya",
      "I went to Your [the curer's] abode, and became only yours! [3]"
    ]
  ]
}
