{
  "id": "kithe-ishq-da-rog",
  "title": {
    "original": "Kithe Ishq Da Rog Na La Baithin",
    "english": "Do not catch the ailment of Love."
  },
  "link": "https://www.youtube.com/watch?v=7B1KWs_qrDc",
  "language": "Urdu",
  "singer": "Nusrat Fateh Ali Khan",
  "lyricist": "Hafiz",
  "translation": "Harman",
  "commentary": [
    "Sufi prose in ode to Baba Bulleh Shah; on the nature of Love.",
    "'Love' here could be interpreted in a myriad of ways - depending on one's disposition.",
    "I have left Love capitalized since love is anthropomorphized in the original language of the poem.",
    "Some references seem to indicate worldly love - yet others equate Love to God."
  ],
  "footnotes": [
    "[1] Reference to Joseph's fate in the Abrahamic traditions.",
    "[2] Female protagonist of the Punjabi love story, 'Heer-Ranjha'.",
    "[3] Female protagonist of the Punjabi love story, 'Sassi-Punhun'.",
    "[4] Male protagonists of the Punjabi love stories, 'Sohni-Mahiwal' and 'Heer-Ranjha' respectively."
  ],
  "lyrics": [
    [
      "ishq de rog da kite na daru ishq de rog awalle",
      "There exists no cure for the ailment of Love; Love's affliction is unique."
    ],
    [
      "aklan shaklan wale kite ishq ne kamle challe",
      "Even those of intellect and beauty - Love has left them insane!"
    ],
    [
      "ruswayiyaan te khaariyan baajon kujh nahi ishq de palle",
      "Humiliation and intoxication - beyond these, Love has nothing else to offer."
    ],
    [
      "oh barbaad howe kar haafiz ishq ne jehde malle",
      "Left destitute are those houses, says Hafiz, whom Love has visited."
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "dil wakhta vich na paa baithin",
      "Do not let your heart fall into craziness."
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "yaari ishq de naal main laa baithin",
      "Do not befriend Love..."
    ],
    [
      "eh yaar bana ke lut lainda",
      "It makes friends, only to loot them."
    ],
    [
      "eh ishq awalra daku e",
      "This Love is a unique robber..."
    ],
    [
      "bas nain mila ke lut lainda",
      "With only its eyes, it can steal everything from you."
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "dhandh charkhe pauni bhul jayengi",
      "You will forget to put thread in your spinning wheel."
    ],
    [
      "vich galiya de tu rul jayengi",
      "Out in the streets and paths, you shall be lost."
    ],
    [
      "eh bhaar na kidre ja baithin",
      "Do not take this weight upon yourself."
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "jag hai nishaana ishq da ghar ghar fasaana ishq da",
      "The world is in Love's aim; in every house is told the fable of Love."
    ],
    [
      "manzil hai gehri ishq di wakhri kacheri  ishq di",
      "The end goal of Love is unfathomable; Love's justice is separate from this world."
    ],
    [
      "jungle ch dere ishq de arshan te phere ishq de",
      "Love's dwellings are in the forest; Love's wanderings are in the heavens."
    ],
    [
      "mann da na raza matlub di sun da he gal mehboob di",
      "It listens not to the will of the mind; yet it listens to the beloved's voice."
    ],
    [
      "karda kise da pakh nahi kulli da chchad da kakh nahi",
      "It does nothing for anyone; indeed, it even wipes out the poor one's hut."
    ],
    [
      "rakda akal naal vair e kutteyan de chumda pair e",
      "It has old enmities with logic; it kisses the feet of the wretched."
    ],
    [
      "chamda luhaya ishq ne bulla nachaya ishq ne",
      "Love peeled off its own skin; Love caused Bulleh Shah to dance!"
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "bhan challi rovein hasengi",
      "You'll become crazy - crying in sadness, and laughing at the same time."
    ],
    [
      "raatan nu uth uth naseigi",
      "You shall be awoken in the nights, and be forced to wander about."
    ],
    [
      "sudh budh na kite gawa baithin",
      "Do not lose your consciousness and good reason!"
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "khoohe sataya ishq ne misre wakaya ishq ne",
      "Love throws you into wells - and love sells you as a slave in Egypt. [1]"
    ],
    [
      "karda kite zaariyan bakshai kithe sardariyan",
      "Sometimes it blows riches to the wind, other times it bestows wealth."
    ],
    [
      "tuti zulaika ishq ne luti zulaika ishq ne",
      "Love breaks even strong confidence - it robs confidence from you."
    ],
    [
      "kite jit da kite haar da kite dobda kite tarda",
      "Sometimes it wins, sometimes it loses; sometimes it drowns, sometimes it floats."
    ],
    [
      "mu chum lainda dhar da aga ch chala marda",
      "It kisses Fear on the lips and it jumps merrily into fires."
    ],
    [
      "pathar pawaye ishq ne dand vi kadaye ishq ne",
      "Love weighs you down with heavy stones; Love has removed its teeth."
    ],
    [
      "zehran kise layi gholda mu oh vi kujh nahi bolda",
      "For some, it silently mixes poisons - it speaks nothing from its mouth. "
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "wakhri niyaz e ishq di wakhri namaaz e ishq di",
      "Love has a unique desire; Love has a unique prayer."
    ],
    [
      "sajna nu phirda tolda hafiz e dar dar rolda",
      "It tests friendships, says Hafiz, it makes you waste away at many doors."
    ],
    [
      "ehne heer layi zehran gholiyan ne",
      "For Heer [2], it has mixed strong poisons."
    ],
    [
      "ehne sassiyan sohniyan roliyan ne",
      "It has wasted away many beauties like Sassi [3]."
    ],
    [
      "ehda kite wasah na kha baithin",
      "Do not drink what it offers you!"
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "duniya ton bachna paina e",
      "You shall have to stay seperate from the world, in exile."
    ],
    [
      "bann kanjri nachna paina",
      "You shall have to dance like an insane harlot!"
    ],
    [
      "es ishq to jaan bacha baithin",
      "From this Love, save your life!"
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "hanjua nu peena paina e",
      "You shall have to drink your own tears."
    ],
    [
      "mar mar ke jeena paina e",
      "You shall have to repeatedly die, and come to life again."
    ],
    [
      "tu nazar na kite mila baithin",
      "Be wary - don't let your eyes meet!"
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love."
    ],
    [
      "ishq de khaab diya nit niklan ultiya e tadbeera",
      "Convoluted are those plans, hatched in the intoxication of Love."
    ],
    [
      "dukha darda waliya pave pairi ishq zanjeera",
      "Made of pain and suffering - these are the chains Love binds you with."
    ],
    [
      "kahi mahiwal te ranjhe isne kite vang fakeera",
      "Innumerable Mahiwals and Ranjhas it has turned into mendicants [4]. "
    ],
    [
      "lotiya es ishq ne hafiz kayi sassiyan kayi heera",
      "Robbed blind has this Love, says Hafiz, countless Sassis and Heers."
    ],
    [
      "eh ishq de kolon bach kudiye",
      "From this Love, save yourself, innocent girl."
    ],
    [
      "tenu hafiz kehnda sach kudiye",
      "Hafiz speaks the truth to you, innocent girl!"
    ],
    [
      "na izzat shaan gawa baithin",
      "Do not lose your self respect, pride, and peace."
    ],
    [
      "kite ishq da rog na laa baithin",
      "Do not catch the ailment of Love!"
    ]
  ]
}
