{
  "title": {
    "0": "Pyala Rakh De Ek Pasey",
    "1": "Set aside the wine pitcher"
  },
  "link": "https://www.youtube.com/watch?v=kBgl81yuZPs",
  "language": "Urdu",
  "singer": "Nusrat Fateh Ali Khan",
  "translation": "Harman",
  "commentary": [
    "Like much of mystical literature, this poem may be interpreted in different ways (depending on one's bias).",
    "One may imagine a rabble of drunkards entering a bar and singing this poem joyously.",
    "One may also interpret the praise of the 'loving gaze' as superior to the wine as the intoxication of two lovers (the drunkard and the bartender).",
    "Finally, one may interpret the bartender as God, the drunkard as the spiritual aspirant, the wine as divine bliss, and the intoxication as ego-death and ultimately merging with God."
  ],
  "footnotes": [
    "*Rafiq is the author's pen name"
  ],
  "lyrics": [
    {
      "0": "saki tere dar te utte aye mast diwane",
      "1": "O Bartender, on your doorstep, the joyous lovers have arrived!"
    },
    {
      "0": "tere naa diyan dhuma paiya sarey vich zamaney",
      "1": "Your name has become famous in the entire world."
    },
    {
      "0": "sabh nu saki mast bana de par par de peymanay",
      "1": "O Bartender, make everyone happy: Fill, fill the goblet!"
    },
    {
      "0": "nazraan naal pila de sanu khol de aj maikhanay",
      "1": "With your gaze, pour us a drink, open the bar!"
    },
    {
      "0": "hun pyala rakh de ek paasay aj nazran naal pila saki",
      "1": "Now, set aside the pitcher, and quench our thirst with your intoxicating gaze!"
    },
    {
      "0": "sada roz da peena muk jaave aj asia nasha charha saki",
      "1": "End our daily drinking - give me such an eternal intoxication."
    },
    {
      "0": "nasha pakdha nahi uriyaan jaaman thi pura par ke nazran da jaam pila",
      "1": "Why am I still sober? Give me that raw drink - filled to the brim of your gaze!"
    },
    {
      "0": "kareen khyal na sadi masti da aj jaam te jaam luta saki",
      "1": "Pay no heed to our joy - O Bartender, today, let us steal all the wine!"
    },
    {
      "0": "koi nasha nahi is sharaab andar",
      "1": "There is no intoxication in this alcohol."
    },
    {
      "0": "mere saki! mere saki!",
      "1": "My beloved Bartender! My beloved Bartender!"
    },
    {
      "0": "koi nasha nahi es sharaab andar sara nasha ay teriyaan nazraan vich",
      "1": "There is no intoxication in this alcohol - all the intoxication is in your gaze!"
    },
    {
      "0": "has has kay naina de jaam pila aj mathay vat na pa saki",
      "1": "With a smile, serve us the drink of your eyes! O Bartender, don't be angry!"
    },
    {
      "0": "tere bahut puraney gahak haa aj nave nahi peewan aye haa",
      "1": "We are very old customers of yours - we're not newcomers coming for a drink."
    },
    {
      "0": "lay rakh lay jaam pyale vich allah naave hor pila saki",
      "1": "Here, refill the pitcher with wine, by God, O Bartender, give me no more."
    },
    {
      "0": "main te peeni ay, peeni ay, main te peeni ayn, peeni ay",
      "1": "But I must drink! Drink! I must drink! Drink!"
    },
    {
      "0": "jaam naal nahi, balkay naazaran naal",
      "1": "Not the wine, but from your eyes!"
    },
    {
      "0": "aisee mai pila de saki hosh-o-khird bhula de",
      "1": "O Bartender! Give me such a drink, that I forget my senses and rationality!"
    },
    {
      "0": "sadka maikhaney da saki aj ulammey laa de",
      "1": "O Bartender! With the charity of your bar, remove all my worries!"
    },
    {
      "0": "jinnay aj diwaney aye sabk nu mast bana de",
      "1": "All the lovers that have come today - make them all joyous!"
    },
    {
      "0": "je pyala vela naahi bukhaan naal pila de",
      "1": "If the pitcher is not free, then pour me a drink with your hands!"
    },
    {
      "0": "sakiya sun le main tawhid da main main haan mast sharabi",
      "1": "Listen beloved Bartender, I am one with Oneness - I am a joyous drunk!"
    },
    {
      "0": "jedi marzi de de meinu mangda nahi gulabi",
      "1": "Give me any flavour of drink, I don't ask for the expensive pink drink!"
    },
    {
      "0": "tu nahi vela mainu de de maikhaney di chaabi",
      "1": "If you are not free, then give me the keys to the bar!"
    },
    {
      "0": "ay gal meri sunle saki main tan nahi wahabi",
      "1": "Listen beloved Bartender, I am not traditional or orthodox!"
    },
    {
      "0": "rindaan da maikhaney baajo hunda nahi guzara",
      "1": "The drunkards cannot obtain sustenance without your bar!"
    },
    {
      "0": "vasda ravay maikahan tera, ujjar javay jag sara",
      "1": "May your bar forever prosper, even if the rest of the world be ruined!"
    },
    {
      "0": "lokaan nu badh mast banaway, sanu laavey lara",
      "1": "Your bar makes other people very joyous, but lies and cheats us!"
    },
    {
      "0": "kan khol keh sun le saaqi, wadeya thekedara",
      "1": "Open your ears, and listen O Bartender - you great businessman!"
    },
    {
      "0": "sohni main sohna maikhana sohna tu vi saki",
      "1": "I am beautiful, and so is the bar. O Bartender, you are so beautiful too!"
    },
    {
      "0": "asi tere aan gahak puraney saada satho kyon hai aaki",
      "1": "We are your old customers - why are you so angered with us?"
    },
    {
      "0": "mast alast rafiq nu karde hosh rahe na baaqi",
      "1": "Make Rafiq* so joyous, that his own ego does not remain!"
    },
    {
      "0": "de sharab manamu saki de na pa chataki",
      "1": "O Bartender, give me a strong alchohol, nothing weak!"
    },
    {
      "0": "sun key aya dooro saki eh karam nawazi teri",
      "1": "O Bartender, I have come from far away - hearing of your miracles!"
    },
    {
      "0": "shonk sharab da mainu saki lagi si ghanderi",
      "1": "O Bartender, I have a passion for alchohol - it is sweet like sugarcane!"
    },
    {
      "0": "mu nu lag gayi chutdi naahi tauba kara batheri",
      "1": "Once it touches my lips, I cannot let go - I vowed to renounce it many times!"
    },
    {
      "0": "vekh keh teriya mast nigavan tut gayi tauba meri",
      "1": "Seeing your intoxicating eyes, my vows instantly broke!"
    },
    {
      "0": "main te peeni ay, peeni ay, main te peeni ayn, peeni ay",
      "1": "But I must drink! Drink! I must drink! Drink!"
    },
    {
      "0": "lay rakh lay jaam pyale vich allah naave hor pila saki",
      "1": "Here, refill the pitcher with wine, by God, O Bartender, give me no more."
    },
    {
      "0": "aj aisa rafiq nu ghutt karda masti vich hasti bhul javan",
      "1": "Today, make Rafiq* so nullified, that in great joy, I lose my own existence."
    },
    {
      "0": "tere maikhanay di kher hove aj aisa mast bana saki",
      "1": "May your bar be so blessed, O Bartender - make us so joyous today!"
    },
    {
      "0": "hun pyala rakh de ek paasay aj nazran naal pila saki",
      "1": "Now, set aside the pitcher, and quench our thirst with your intoxicating gaze!"
    }
  ]
}
