{
  "id": "sambh-leh-dahooda",
  "title": {
    "original": "Sambh Leh Dahooda",
    "english": "Take care, 'Dahood'."
  },
  "link": "https://www.youtube.com/watch?v=DZUY2OL2wTI",
  "language": "Punjabi",
  "singer": "Kuldeep Manak",
  "lyricist": "Unknown",
  "translation": "Harman",
  "commentary": [
    "Based on an old Punjabi folk tale - of a supposed far away King of Baghdad, King Dahood.",
    "The story goes that through the intrigues of his relatives, young Dahood and his mother, Queen Hansa, are exiled.",
    "Losing their kingdom, they live in poverty - young Dahood forgetting his throne completely.",
    "As a child, Dahood befriends a princess, and they bond over time.",
    "The king arranges the marriage of the princess to a foreign king.",
    "The princess laments to Dahood - reminding him of his past, trying to reawaken the desire of the throne in him."
  ],
  "lyrics": [
    {
      "0": "sambh leh dahooda ahkey mang teri nu",
      "1": "Come and take care of me, Dahood - your beloved!"
    },
    {
      "0": "o kaava vich fasi hoyi [?] nu",
      "1": "This dove trapped amongst crows!"
    },
    {
      "0": "nit de siape gal pay jaan gey",
      "1": "Otherwise, my every day will be filled with mourning."
    },
    {
      "0": "kal nu viah ke mainu leh jaan gey",
      "1": "Tomorrow, they shall come - to marry and take me away!"
    },
    {
      "0": "o rom mera jidhe naal mai ha mangti",
      "1": "He is so old! The one to whom I have been betrothed."
    },
    {
      "0": "sol jehi jind meri sooli tankdi",
      "1": "My innocent and young life has been sacrificed in such a way!"
    },
    {
      "0": "tere naalo channa mere dekh tor key",
      "1": "My moon-faced beloved, look how my relatives have cut ties with you."
    },
    {
      "0": "paun na rupeya teri choli mor ke",
      "1": "They give you no charity, turning you away at the gates!"
    },
    {
      "0": "zulm kive a dil seh jaan gey",
      "1": "How can anyone's heart bear such injustice?"
    },
    {
      "0": "kal nu viah ke mainu leh jaan gey",
      "1": "Tomorrow, they shall come - to marry and take me away!"
    },
    {
      "0": "gala bata naal hon nahi ga sarna",
      "1": "Mere words and talk is not enough to fix this."
    },
    {
      "0": "pauga dahooda koi hila karna",
      "1": "Dahood! We must do something to solve this problem."
    },
    {
      "0": "marda de vang aja hik taanke",
      "1": "Like a brave man: Come forward with your chest filled with pride!"
    },
    {
      "0": "sari umer teri rahu banke",
      "1": "Then, for my whole life I will be yours only!"
    },
    {
      "0": "nahi ta adoore cha reh jaan gey",
      "1": "Otherwise, all our wishes will be left incomplete."
    },
    {
      "0": "kal nu viah ke mainu leh jaan gey",
      "1": "Tomorrow, they shall come - to marry and take me away!"
    },
    {
      "0": "mere mapeya ne zulm kama leya",
      "1": "My parents have committed a great injustice."
    },
    {
      "0": "tenu chad bho apna bna leya",
      "1": "They have forsaken you and embraced foreigners."
    },
    {
      "0": "o mang teri mang deti kise hor nu",
      "1": "They have engaged your beloved to someone else!"
    },
    {
      "0": "vekhna dahooda hun tere zor nu",
      "1": "We must see your strength, Dahood!"
    },
    {
      "0": "ahke barati buhe beh jaan gey",
      "1": "Soon, the wedding procession shall come and sit outside my door."
    },
    {
      "0": "kal nu viah ke mainu leh jaan gey",
      "1": "Tomorrow, they shall come - to marry and take me away!"
    },
    {
      "0": "umer niani vich teri hoi ve",
      "1": "Since childhood, I belonged to you only."
    },
    {
      "0": "tere bina naal kaun mere koi ve",
      "1": "Besides you, no one is loyal and dear to me!"
    },
    {
      "0": "hoye ne udheek deya keyi saal ve",
      "1": "We have spent so many years waiting."
    },
    {
      "0": "jiva mara gayi channa tere naal ve",
      "1": "Living, or dying - I shall do with you alone, my beloved!"
    },
    {
      "0": "[?] lok sach keh jaan gey",
      "1": "The people of the future, will sing our true story."
    },
    {
      "0": "kal nu viah ke mainu leh jaan gey",
      "1": "Tomorrow, they shall come - to marry and take me away!"
    }
  ]
}
