{
  "id": "tere-tille-ton",
  "title": {
    "original": "Tere Tille Ton",
    "english": "From Your Hillock."
  },
  "link": "https://www.youtube.com/watch?v=DDhamZ6Bn8k",
  "language": "Punjabi",
  "singer": "Kuldeep Manak",
  "lyricist": "Dev Tharikewala",
  "translation": "Harman",
  "commentary": [
    "A take on one chapter in Waris Shah's Punjabi love story, 'Heer-Ranjha'",
    "In this chapter, we catch up with Ranjha, who after being rejected by Heer's parents, has become a wandering Yogi.",
    "Arriving at the famous 'Tilla Jogian' (Hillock of Ascetics) of his Guru, Gorakhnath, Ranjha reminisces about Heer.",
    "After doing so, he resolves to return to Heer's village for one last attempt to elope with her."
  ],
  "footnotes": [
    "[1] 'Jatti' is used for female member of the agriculturalist 'Jatt' ethnic group (to which Waris Shah's Heer belongs) - it is used as a nickname for Heer here (i.e. as the farmer's daughter).",
    "[2] 'Surahi' is a long-necked medieval pot or bottle.",
    "[3] 'Trinjan' is a traditional female-only space in a Punjabi village where women gather to work and socialize.",
    "[4] 'Tauba' is a Punjabi expression equivalent to 'Oh My God'.",
    "[5] 'Hazara' here means 'Thousands', but may be a double entendre for 'Takht Hazara' (Ranjha's hometown).",
    "[6] 'Chuchak' is Heer's father, who is arranging her marriage (against Heer's and Ranjha's wishes).",
    "[7] 'Jog' means the discipline of the ascetic Jogis (a.k.a. Yogis).",
    "[8] In Punjab wandering Jogis would use such shuris (i.e. daggers) mounted on antelope horn as crutches, and for initiation ceremonies.",
    "[9] 'Khedeyan' is the name of village where Heer now lives after her marriage to Saida Khera.",
    "[10] During her marriage day.",
    "[11] This is a paradox - since Pundits (known to be practising Hindus) are known to never to eat meat.",
    "[12] This is a paradox - since Qazis (known to be practising Muslims) are known to never drink alcohol.",
    "[13] Through these paradoxes, the poet explains Ranjha's mental state (after losing Heer, his world is completely upside down)."
  ],
  "lyrics": [
    [
      "tere tille ton, oh soorat deendiya heer di",
      "From your hillock, I can see Heer's face!"
    ],
    [
      "oh lai vekh gorkha, udh di aa phulkaari",
      "Look there Gorakh, her floral scarf is flying!"
    ],
    [
      "bul pateesian odhian, gallan galgal naal diya",
      "With lips like sweets, her cheeks are like citrus fruits."
    ],
    [
      "towa thodi de vich, na patli na bhaari",
      "With a dimple in her chin, and [she is] neither thin, nor plump."
    ],
    [
      "dono nain jatti de, bhare ne khaul sharaab de",
      "Both eyes of that farmer's daughter[1] are like cups of alcohol!"
    ],
    [
      "taun surahi, mangi mirga tor udhaari",
      "With a neck like a surahi[2], her gait seems borrowed from deer."
    ],
    [
      "gori taun duale, kaali gaani jatti de",
      "Around her fair-skinned neck, she wears a black necklace."
    ],
    [
      "chandan geli nu, jyon naaga kundli maari",
      "Like how around a sandalwood tree, the snake coils itself."
    ],
    [
      "baithi trinjana de vich, oh charkhe tand paondi a",
      "Sitting in the Trinjan[3], she adds thread to her spinning wheel."
    ],
    [
      "vekh ke rang jatti da, tauba karan lalaari",
      "Looking at her colours, even cloth dyers cry out, 'Tauba!'[4]"
    ],
    [
      "gujji heer rahe naa, meri vich hazaaran de",
      "My Heer cannot stay hidden amongst thousands[5]."
    ],
    [
      "dhee oh chuchak di hai, hai saha ton pyari",
      "She may be the daughter of 'Chuchak'[6], but she is more dear to me than my own breath."
    ],
    [
      "jatti khatar aya, jog lain nu tille ton main tere",
      "For the sake of that farmer's daughter, I have come to your hillock, to obtain 'jog'[7]."
    ],
    [
      "paa de mundran kani, shuri fer ik vari",
      "So, put the Jogi's earrings in my ears, and wave your ceremonial dagger about once![8]"
    ],
    [
      "ja ke khedeyan de pind, darshan kariye heer de",
      "We shall go to Khedeyan[9], to catch a glimpse of Heer."
    ],
    [
      "kahe tharikewala, ishq hai bury bimari",
      "Says Tharikewala, love is a terrible affliction."
    ],
    [
      "nain sandli jatti de, pij gaye ne",
      "When her beautiful eyes became wet with tears[10]."
    ],
    [
      "ghar pandita de murgey, rij gaye ne",
      "Then, in the house of Pundits, chickens were cooked[11]."
    ],
    [
      "munde qaajian de daru peen, gij gaye ne",
      "Then, the sons of Qazis, became alcholics[12]."
    ],
    [
      "thag tut geya saari duniya da",
      "In this way, the entire order of the world has been broken[13]!"
    ]
  ]
}